package com.ruihai.xingka;

/**
 * Created by zecker on 15/8/15.
 */
public class Constant {
    // 短信验证码 http://mob.com/
    public static final String MOBSMS_APPKEY = "d6d2143515be";
    public static final String MOBSMS_APPSECRET = "09acfff28f090c1e5271cc378eda867a";

    public static final String UM_SHARE_DESCRIPTOR = "com.umeng.share";
    public static final String UM_LOGIN_DESCRIPTOR = "com.umeng.login";

    // 微信开发平台 https://open.weixin.qq.com (debug)
//    public static final String WEIXIN_APPID = "wx1d8645922175f7a3";
//    public static final String WEIXIN_APPSECRET = "6f5a6d9393c1fc213fbb2989701aa46e";

    // 微信开发平台 https://open.weixin.qq.com (release)
    public static final String WEIXIN_APPID = "wx01a83b0df84bab99";
    public static final String WEIXIN_APPSECRET = "d4624c36b6795d1d99dcf0547af5443d";

    // QQ http://connect.qq.com
    public static final String QQSSO_APPID = "1104779029";
    public static final String QQSSO_APPKEY = "lxaeNqrefG4vnD8j";

    //新浪微博开发平台
    public static final String WEIBO_APPKEY = "2799043495";
    public static final String WEIBO_APPSECRCT = "7d437d40fa7f3cf6b406ffd0f5da79d7";

    // 默认GUID
    public static final String DEFAULT_UUID = "00000000-0000-0000-0000-000000000000";
    // 图说内容格式
    public static final String FORMAT_CAPTION_CONTENT = "<font color='#9b9ba4'>“ </font><font color='#3c3a41'>%s</font><font color='#9b9ba4'> ”</font>";

    public static final String[] startTime = new String[]{"1:00", "2:00", "3:00", "4:00", "5:00", "6:00", "7:00", "8:00", "9:00", "10:00", "11:00", "12:00", "13:00", "14:00", "15:00", "16:00", "17:00", "18:00", "19:00", "20:00", "21:00", "22:00", "23:00", "24:00"};

    public static final String endTime[][] = new String[][]{
            // 1:00
            new String[]{"1:00", "2:00", "3:00", "4:00", "5:00", "6:00", "7:00", "8:00", "9:00", "10:00", "11:00", "12:00", "13:00", "14:00", "15:00", "16:00", "17:00", "18:00", "19:00", "20:00", "21:00", "22:00", "23:00", "24:00"},
            // 2:00
            new String[]{"1:00", "2:00", "3:00", "4:00", "5:00", "6:00", "7:00", "8:00", "9:00", "10:00", "11:00", "12:00", "13:00", "14:00", "15:00", "16:00", "17:00", "18:00", "19:00", "20:00", "21:00", "22:00", "23:00", "24:00"},
            // 3:00
            new String[]{"1:00", "2:00", "3:00", "4:00", "5:00", "6:00", "7:00", "8:00", "9:00", "10:00", "11:00", "12:00", "13:00", "14:00", "15:00", "16:00", "17:00", "18:00", "19:00", "20:00", "21:00", "22:00", "23:00", "24:00"},
            // 4:00
            new String[]{"1:00", "2:00", "3:00", "4:00", "5:00", "6:00", "7:00", "8:00", "9:00", "10:00", "11:00", "12:00", "13:00", "14:00", "15:00", "16:00", "17:00", "18:00", "19:00", "20:00", "21:00", "22:00", "23:00", "24:00"},
            // 5:00
            new String[]{"1:00", "2:00", "3:00", "4:00", "5:00", "6:00", "7:00", "8:00", "9:00", "10:00", "11:00", "12:00", "13:00", "14:00", "15:00", "16:00", "17:00", "18:00", "19:00", "20:00", "21:00", "22:00", "23:00", "24:00"},
            // 6:00
            new String[]{"1:00", "2:00", "3:00", "4:00", "5:00", "6:00", "7:00", "8:00", "9:00", "10:00", "11:00", "12:00", "13:00", "14:00", "15:00", "16:00", "17:00", "18:00", "19:00", "20:00", "21:00", "22:00", "23:00", "24:00"},
            // 7:00
            new String[]{"1:00", "2:00", "3:00", "4:00", "5:00", "6:00", "7:00", "8:00", "9:00", "10:00", "11:00", "12:00", "13:00", "14:00", "15:00", "16:00", "17:00", "18:00", "19:00", "20:00", "21:00", "22:00", "23:00", "24:00"},
            // 8:00
            new String[]{"1:00", "2:00", "3:00", "4:00", "5:00", "6:00", "7:00", "8:00", "9:00", "10:00", "11:00", "12:00", "13:00", "14:00", "15:00", "16:00", "17:00", "18:00", "19:00", "20:00", "21:00", "22:00", "23:00", "24:00"},
            // 9:00
            new String[]{"1:00", "2:00", "3:00", "4:00", "5:00", "6:00", "7:00", "8:00", "9:00", "10:00", "11:00", "12:00", "13:00", "14:00", "15:00", "16:00", "17:00", "18:00", "19:00", "20:00", "21:00", "22:00", "23:00", "24:00"},
            // 10:00
            new String[]{"1:00", "2:00", "3:00", "4:00", "5:00", "6:00", "7:00", "8:00", "9:00", "10:00", "11:00", "12:00", "13:00", "14:00", "15:00", "16:00", "17:00", "18:00", "19:00", "20:00", "21:00", "22:00", "23:00", "24:00"},
            // 11:00
            new String[]{"1:00", "2:00", "3:00", "4:00", "5:00", "6:00", "7:00", "8:00", "9:00", "10:00", "11:00", "12:00", "13:00", "14:00", "15:00", "16:00", "17:00", "18:00", "19:00", "20:00", "21:00", "22:00", "23:00", "24:00"},
            // 12:00
            new String[]{"1:00", "2:00", "3:00", "4:00", "5:00", "6:00", "7:00", "8:00", "9:00", "10:00", "11:00", "12:00", "13:00", "14:00", "15:00", "16:00", "17:00", "18:00", "19:00", "20:00", "21:00", "22:00", "23:00", "24:00"},
            // 13:00
            new String[]{"1:00", "2:00", "3:00", "4:00", "5:00", "6:00", "7:00", "8:00", "9:00", "10:00", "11:00", "12:00", "13:00", "14:00", "15:00", "16:00", "17:00", "18:00", "19:00", "20:00", "21:00", "22:00", "23:00", "24:00"},
            // 14:00
            new String[]{"1:00", "2:00", "3:00", "4:00", "5:00", "6:00", "7:00", "8:00", "9:00", "10:00", "11:00", "12:00", "13:00", "14:00", "15:00", "16:00", "17:00", "18:00", "19:00", "20:00", "21:00", "22:00", "23:00", "24:00"},
            // 15:00
            new String[]{"1:00", "2:00", "3:00", "4:00", "5:00", "6:00", "7:00", "8:00", "9:00", "10:00", "11:00", "12:00", "13:00", "14:00", "15:00", "16:00", "17:00", "18:00", "19:00", "20:00", "21:00", "22:00", "23:00", "24:00"},
            // 16:00
            new String[]{"1:00", "2:00", "3:00", "4:00", "5:00", "6:00", "7:00", "8:00", "9:00", "10:00", "11:00", "12:00", "13:00", "14:00", "15:00", "16:00", "17:00", "18:00", "19:00", "20:00", "21:00", "22:00", "23:00", "24:00"},
            // 17:00
            new String[]{"1:00", "2:00", "3:00", "4:00", "5:00", "6:00", "7:00", "8:00", "9:00", "10:00", "11:00", "12:00", "13:00", "14:00", "15:00", "16:00", "17:00", "18:00", "19:00", "20:00", "21:00", "22:00", "23:00", "24:00"},
            // 18:00
            new String[]{"1:00", "2:00", "3:00", "4:00", "5:00", "6:00", "7:00", "8:00", "9:00", "10:00", "11:00", "12:00", "13:00", "14:00", "15:00", "16:00", "17:00", "18:00", "19:00", "20:00", "21:00", "22:00", "23:00", "24:00"},
            // 19:00
            new String[]{"1:00", "2:00", "3:00", "4:00", "5:00", "6:00", "7:00", "8:00", "9:00", "10:00", "11:00", "12:00", "13:00", "14:00", "15:00", "16:00", "17:00", "18:00", "19:00", "20:00", "21:00", "22:00", "23:00", "24:00"},
            // 20:00
            new String[]{"1:00", "2:00", "3:00", "4:00", "5:00", "6:00", "7:00", "8:00", "9:00", "10:00", "11:00", "12:00", "13:00", "14:00", "15:00", "16:00", "17:00", "18:00", "19:00", "20:00", "21:00", "22:00", "23:00", "24:00"},
            // 21:00
            new String[]{"1:00", "2:00", "3:00", "4:00", "5:00", "6:00", "7:00", "8:00", "9:00", "10:00", "11:00", "12:00", "13:00", "14:00", "15:00", "16:00", "17:00", "18:00", "19:00", "20:00", "21:00", "22:00", "23:00", "24:00"},
            // 22:00
            new String[]{"1:00", "2:00", "3:00", "4:00", "5:00", "6:00", "7:00", "8:00", "9:00", "10:00", "11:00", "12:00", "13:00", "14:00", "15:00", "16:00", "17:00", "18:00", "19:00", "20:00", "21:00", "22:00", "23:00", "24:00"},
            // 23:00
            new String[]{"1:00", "2:00", "3:00", "4:00", "5:00", "6:00", "7:00", "8:00", "9:00", "10:00", "11:00", "12:00", "13:00", "14:00", "15:00", "16:00", "17:00", "18:00", "19:00", "20:00", "21:00", "22:00", "23:00", "24:00"},
            // 24:00
            new String[]{"1:00", "2:00", "3:00", "4:00", "5:00", "6:00", "7:00", "8:00", "9:00", "10:00", "11:00", "12:00", "13:00", "14:00", "15:00", "16:00", "17:00", "18:00", "19:00", "20:00", "21:00", "22:00", "23:00", "24:00"},

    };

    public static final String[] provinces = new String[]{"北京市", "天津市", "安徽省", "上海市", "江苏省", "浙江省", "河北省", "山西省", "内蒙古", "辽宁省", "吉林省", "黑龙江省", "福建省", "江西省", "山东省", "河南省", "湖北省", "湖南省", "广东省", "青海省", "甘肃省", "陕西省", "广西", "海南省", "重庆市", "四川省", "贵州省", "云南省 ", "新疆", "西藏", "宁夏", "香港特别行政区", "澳门特别行政区", "台湾省"};

    public static final String cities[][] = new String[][]{
            // 北京市
            new String[]{"东城区", "西城区", "朝阳区", "丰台区", "石景山区", "海淀区", "门头沟区", "房山区", "通州区", "顺义区", "昌平区", "大兴区", "怀柔区", "平谷区", "密云县", "延庆县"},
            // 天津市
            new String[]{"和平区", "河东区", "河西区", "南开区", "河北区", "红桥区", "东丽区", "西青区", "津南区", "北辰区", "武清区", "宝坻区", "滨海新区", "宁河县", "静海县", "蓟县"},
            // 安徽省
            new String[]{"合肥市", "安庆市", "蚌埠市", "亳州市", "池州市", "滁州市", "阜阳市", "淮北市", "淮南市", "黄山市", "六安市", "马鞍山市", "宿州市", "铜陵市", "芜湖市", "宣城市"},
            // 上海市
            new String[]{"黄浦区", "徐汇区", "长宁区", "静安区", "普陀区", "闸北区", "虹口区", "杨浦区", "闵行区", "宝山区", "嘉定区", "浦东新区", "金山区", "松江区", "青浦区", "奉贤区", "崇明县"},
            // 江苏省
            new String[]{"南京市", "无锡市", "徐州市", "常州市", "苏州市", "淮安市", "连云港市", "南通市", "宿迁市", "泰州市", "盐城市", "扬州市", "镇江市"},
            // 浙江省
            new String[]{"杭州市", "湖州市", "嘉兴市", "金华市", "丽水市", "宁波市", "衢州市", "绍兴市", "台州市", "温州市", "舟山市"},
            // 河北省
            new String[]{"石家庄市", "唐山市", "秦皇岛市", "邯郸市", "邢台市", "保定市", "张家口市", "承德市", "沧州市", "廊坊市", "衡水市"},
            // 山西省
            new String[]{"太原市", "大同市", "阳泉市", "长治市", "晋城市", "朔州市", "晋中市", "运城市", "忻州市", "临汾市", "吕梁市"},
            // 内蒙古自治区
            new String[]{"呼和浩特市", "包头市", "乌海市", "赤峰市", "通辽市", "鄂尔多斯市", "呼伦贝尔市", "巴彦淖尔市", "乌兰察布市", "兴安盟", "锡林郭勒盟", " 阿拉善盟"},
            // 辽宁省
            new String[]{"沈阳市", "大连市", "鞍山市", "本溪市", "丹东市", "锦州市", "营口市", "阜新市", "辽阳市", "盘锦市", "铁岭市", "朝阳市", "葫芦岛市"},
            // 吉林省
            new String[]{"长春市", "吉林市", "四平市", "辽源市", "通化市", "白山市", "松原市", "白城市", "延边朝鲜族自治州"},
            // 黑龙江省
            new String[]{"哈尔滨市", "齐齐哈尔市", "鸡西市", "鹤岗市", "双鸭山市", "大庆市", "伊春市", "佳木斯市", "七台河市", "牡丹江市", "黑河市", "绥化市"},
            // 福建省
            new String[]{"福州市", "龙岩市", "南平市", "宁德市", "莆田市", "泉州市", "三明市", "厦门市", "漳州市"},
            // 江西省
            new String[]{"南昌市", "抚州市", "赣州市", "吉安市", "景德镇市", "九江市", "上饶市", "新余市", "宜春市", "鹰潭市", "萍乡市"},
            // 山东省
            new String[]{"济南市", "滨州市", "德州市", "东营市", "菏泽市", "济宁市", "莱芜市", "聊城市", "临沂市", "青岛市", "日照市", "泰安市", "威海市", "潍坊市", "烟台市", "潍坊市", "烟台市", "枣庄市", "淄博市"},
            // 河南省
            new String[]{"郑州市", "安阳市", "鹤壁市", "焦作市", "开封市", "洛阳市", "漯河市", "南阳市", "平顶山市", "濮阳市", "三门峡市", "商丘市", "新乡市", "信阳市", "许昌市", "周口市", "驻马店市"},
            // 湖北省
            new String[]{"武汉市", "鄂州市", "黄冈市", "黄石市", "荆门市", "荆州市", "恩施土家族苗族自治州", "十堰市", "随州市", "咸宁市", "襄樊市", "孝感市", "宜昌市"},
            // 湖南省
            new String[]{"长沙市", "常德市", "郴州市", "衡阳市", "怀化市", "娄底市", "邵阳市", "湘潭市", "湘西土家族苗族自治州", "益阳市", "永州市", "岳阳市", "张家界市", "株洲市"},
            // 广东省
            new String[]{"广州市", "潮州市", "东莞市", "佛山市", "河源市", "惠州市", "江门市", "揭阳市", "茂名市", "梅州市", "清远市", "汕头市", "汕尾市", "韶关市", "深圳市", "阳江市", "云浮市", "湛江市", "肇庆市", "中山市", "珠海市"},
            // 青海省
            new String[]{"西宁市", "果洛藏族自治州", "海北藏族自治州", "海东地区", "海南藏族自治州", "海西蒙古族藏族自治州", "黄南藏族自治州", "玉树藏族自治州"},
            // 甘肃省 ""
            new String[]{"兰州市", "白银市", "定西市", "甘南藏族自治州", "嘉峪关市", "金昌市", "酒泉市", "临夏回族自治州", "陇南市", "平凉市", "庆阳市", "天水市", "武威市", "张掖市"},
            // 陕西省
            new String[]{"西安市", "安康市", "咸阳市", "宝鸡市", "汉中市", "商洛市", "铜川市", "渭南市", "延安市", "榆林市"},
            // 广西壮族自治区
            new String[]{"南宁市", "百色市", "北海市", "崇左市", "防城港市", "贵港市", "桂林市", "河池市", "贺州市", "来宾市", "柳州市", "钦州市", "梧州市", "玉林市"},
            // 海南省
            new String[]{"海口市", "三亚市", "三沙市"},
            // 重庆市
            new String[]{"万州区", "涪陵区", "渝中区", "大渡口区", "江北区", "沙坪坝区", "九龙坡区", "南岸区", "北碚区", "綦江区", "大足区", "渝北区", "巴南区", "黔江区", "长寿区", "江津区", "合川区", "永川区", "南川区", "潼南县", "铜梁县", "荣昌县", "璧山县", "梁平县", "城口县", "丰都县", "垫江县", "武隆县", "忠县", "开县", "云阳县", "奉节县", "巫山县", "巫溪县", "石柱土家族自治县", "秀山土家族苗族自治县", "酉阳土家族苗族自治县", "彭水苗族土家族自治县"},
            // 四川省
            new String[]{"成都市", "巴中市", "达州市", "德阳市", "甘孜藏族自治州", "广安市", "广元市", "乐山市", "凉山彝族自治州", "泸州市", "眉山市", "绵阳市", "阿坝藏族羌族自治州", "内江市", "南充市", "攀枝花市", "遂宁市", "雅安市", "宜宾市", "资阳市", "自贡市"},
            // 贵州省
            new String[]{"贵阳市", "安顺市", "毕节地区", "六盘水市", "黔东南苗族侗族自治州", "黔南布依族苗族自治州", "黔西南布依族苗族自治州", "铜仁地区", "遵义市"},
            // 云南省
            new String[]{"昆明市", "保山市", "楚雄彝族自治州", "大理白族自治州", "德宏傣族景颇族自治州", "迪庆藏族自治州", "红河哈尼族彝族自治州", "丽江市", "临沧市", "怒江僳僳族自治州", "普洱市", "曲靖市", "文山壮族苗族自治州", "西双版纳傣族自治州", "玉溪市", "昭通市"},
            // 新疆维吾尔自治区
            new String[]{"乌鲁木齐市", "阿克苏地区", "阿勒泰地区", "巴音郭楞蒙古自治州", "博尔塔拉蒙古自治州", "昌吉回族自治州", "哈密地区", "和田地区", "喀什地区", "克拉玛依市", "克孜勒苏柯尔克孜自治州", "塔城地区", "吐鲁番地区", "伊犁哈萨克自治州"},
            // 西藏自治区
            new String[]{"拉萨市", "阿里地区", "昌都地区", "林芝地区", "那曲地区", "日喀则地区", "山南地区"},
            // 宁夏回族自治区
            new String[]{"银川市", "固原市", "石嘴山市", "吴忠市", "中卫市"},
            //香港特别行政区
            new String[]{"香港半岛", "九龙", "新界", "离岛"},
            //澳门特别行政区
            new String[]{"澳门半岛", "氹仔岛", "路环岛"},
            //台湾省
            new String[]{"台北市", "新北市", "台中市", "台南市", "高雄市"},
    };
}
